In [2]:
import pandas as pd
import numpy as np
 
import seaborn as sns
from matplotlib import pyplot as plt
%matplotlib inline

## Download the data

In [3]:
data='https://raw.githubusercontent.com/gastonstat/CreditScoring/refs/heads/master/CreditScoring.csv'
!wget -O CreditScoring.csv $data
df = pd.read_csv('CreditScoring.csv')
df.head()

--2025-11-21 10:57:21--  https://raw.githubusercontent.com/gastonstat/CreditScoring/refs/heads/master/CreditScoring.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.109.133, 185.199.110.133, 185.199.111.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.109.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 182489 (178K) [text/plain]
Saving to: ‘CreditScoring.csv’

CreditScoring.csv   100%[===================>] 178.21K  --.-KB/s    in 0.1s

2025-11-21 10:57:22 (1.20 MB/s) - ‘CreditScoring.csv’ saved [182489/182489]

,Status,Seniority,Home,Time,Age,Marital,Records,Job,Expenses,Income,Assets,Debt,Amount,Price
0,1,9,1,60,30,2,1,3,73,129,0,0,800,846
1,1,17,1,60,58,3,1,1,48,131,0,0,1000,1658
2,2,10,2,36,46,2,2,3,90,200,3000,0,2000,2985
3,1,0,1,60,24,1,1,1,63,182,2500,0,900,1325
4,1,0,1,36,26,1,1,1,46,107,0,0,310,910

# Some data manipulations

In [4]:
df.columns = df.columns.str.lower()
df.head()

,status,seniority,home,time,age,marital,records,job,expenses,income,assets,debt,amount,price
0,1,9,1,60,30,2,1,3,73,129,0,0,800,846
1,1,17,1,60,58,3,1,1,48,131,0,0,1000,1658
2,2,10,2,36,46,2,2,3,90,200,3000,0,2000,2985
3,1,0,1,60,24,1,1,1,63,182,2500,0,900,1325
4,1,0,1,36,26,1,1,1,46,107,0,0,310,910

In [5]:
df.status.value_counts()

status
1    3200
2    1254
0       1
Name: count, dtype: int64

In [6]:
statues_values={
    1: 'ok',
    2: 'bad',
    0: 'unknow'
}

home_values = {
    1: 'rent',
    2: 'owner',
    3: 'private',
    4: 'ignore',
    5: 'parents',
    6: 'other',
    0: 'unk'
}

marital_values = {
    1: 'single', 
    2: 'married', 
    3: 'widow', 
    4: 'separated',
    5: 'divorced',
    0: 'unk'
}

records_values = {
    1: 'no',
    2: 'yes',
    0: 'unk'
}

job_values = {
    1: 'fixed', 
    2: 'partime', 
    3: 'freelance', 
    4: 'others',
    0: 'unk'
}

df['status'] = df['status'].map(statues_values)
df['home'] = df['home'].map(home_values)
df['marital'] = df['marital'].map(marital_values)
df['records'] = df['records'].map(records_values)
df['job'] = df['job'].map(job_values)
df.head()

,status,seniority,home,time,age,marital,records,job,expenses,income,assets,debt,amount,price
0,ok,9,rent,60,30,married,no,freelance,73,129,0,0,800,846
1,ok,17,rent,60,58,widow,no,fixed,48,131,0,0,1000,1658
2,bad,10,owner,36,46,married,yes,freelance,90,200,3000,0,2000,2985
3,ok,0,rent,60,24,single,no,fixed,63,182,2500,0,900,1325
4,ok,0,rent,36,26,single,no,fixed,46,107,0,0,310,910

In [7]:
df.describe().round(2)

,seniority,time,age,expenses,income,assets,debt,amount,price
count,4455.00,4455.00,4455.00,4455.00,4455.00,4455.00,4455.00,4455.00,4455.00
mean,7.99,46.44,37.08,55.57,763316.99,1060340.81,404381.96,1039.02,1462.88
std,8.17,14.66,10.98,19.52,8703625.26,10217568.67,6344253.40,474.54,628.09
min,0.00,6.00,18.00,35.00,0.00,0.00,0.00,100.00,105.00
25%,2.00,36.00,28.00,35.00,80.00,0.00,0.00,700.00,1117.50
50%,5.00,48.00,36.00,51.00,120.00,3500.00,0.00,1000.00,1400.00
75%,12.00,60.00,45.00,72.00,166.00,6000.00,0.00,1300.00,1692.00
max,48.00,72.00,68.00,180.00,99999999.00,99999999.00,99999999.00,5000.00,11140.00

In [8]:
for c in ['income', 'assets', 'debt']:
    df[c] = df[c].replace(99999999, np.nan)
df.describe().round(2)

,seniority,time,age,expenses,income,assets,debt,amount,price
count,4455.00,4455.00,4455.00,4455.00,4421.00,4408.00,4437.00,4455.00,4455.00
mean,7.99,46.44,37.08,55.57,130.57,5403.43,342.95,1039.02,1462.88
std,8.17,14.66,10.98,19.52,86.37,11573.16,1245.86,474.54,628.09
min,0.00,6.00,18.00,35.00,0.00,0.00,0.00,100.00,105.00
25%,2.00,36.00,28.00,35.00,80.00,0.00,0.00,700.00,1117.50
50%,5.00,48.00,36.00,51.00,120.00,3000.00,0.00,1000.00,1400.00
75%,12.00,60.00,45.00,72.00,165.00,6000.00,0.00,1300.00,1692.00
max,48.00,72.00,68.00,180.00,959.00,300000.00,30000.00,5000.00,11140.00

In [9]:
df = df[df.status != 'unknow'].reset_index(drop=True)
df.status.value_counts()

status
ok     3200
bad    1254
Name: count, dtype: int64

# Eliminate unbalance on the target value

In [10]:
# Separate majority and minority classes
df_ok = df[df['status'] == 'ok']
df_bad = df[df['status'] == 'bad']

df_ok_downsampled = df_ok.sample(n=1254, random_state=42)
df_balanced = pd.concat([df_ok_downsampled, df_bad]).sample(frac=1, random_state=42).reset_index(drop=True)

df_balanced.status.value_counts()
df_balanced.head()

,status,seniority,home,time,age,marital,records,job,expenses,income,assets,debt,amount,price
0,bad,0,rent,60,36,married,no,others,47,121.0,0.0,0.0,900,1423
1,ok,15,owner,60,50,widow,no,fixed,45,156.0,9800.0,0.0,700,1136
2,bad,3,owner,48,21,single,no,fixed,35,466.0,6000.0,0.0,2700,3100
3,bad,0,other,60,25,married,no,partime,60,60.0,0.0,0.0,1300,1380
4,bad,4,parents,48,25,single,no,fixed,35,73.0,0.0,0.0,700,814

# Split the data set

In [11]:
from sklearn.model_selection import train_test_split

df_fulltrain, df_test = train_test_split(df_balanced, test_size=0.2, random_state=11)
df_train, df_val = train_test_split(df_fulltrain, test_size=0.25, random_state=11)

df_train = df_train.reset_index(drop=True)
df_val = df_val.reset_index(drop=True) 
df_test = df_test.reset_index(drop=True)

Check the status of the loan.

In [12]:
df_train.status.value_counts()

status
ok     771
bad    733
Name: count, dtype: int64

The status with bad means the loan what not accepted.

The status with ok is accepted.

The code tranforme the bad values to 1 and ok to 0

In [13]:
(df_train.status=='bad').astype(int)

0       0
1       1
2       1
3       0
4       0
       ..
1499    1
1500    0
1501    0
1502    0
1503    0
Name: status, Length: 1504, dtype: int64

In [14]:
y_train = (df_train.status=='bad').astype(int)
y_val = (df_val.status=='bad').astype(int)
y_test = (df_test.status=='bad').astype(int)

del df_train['status']
del df_val['status']
del df_test['status']

In [16]:
df_train.head()

,seniority,home,time,age,marital,records,job,expenses,income,assets,debt,amount,price
0,3,private,36,20,married,no,fixed,45,50.0,1500.0,100.0,1000,1387
1,2,rent,60,32,married,yes,freelance,60,NaN,0.0,0.0,1100,1480
2,1,parents,36,22,single,no,fixed,35,80.0,8000.0,0.0,490,690
3,15,owner,60,43,married,no,freelance,60,310.0,7000.0,0.0,1200,1297
4,3,owner,48,26,single,no,fixed,35,157.0,7000.0,0.0,1200,2053

In [17]:
numerical=['seniority', 'time', 'age', 'expenses', 'income', 'assets', 'debt', 'amount', 'price']
categorical=['home', 'marital', 'records', 'job']

In [24]:
df_train.isna().sum()
for n in numerical:
    df_train[n].fillna(0, inplace=True)
df_train.isna().sum()

/tmp/ipykernel_1861/1903115827.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_train[n].fillna(0, inplace=True)

seniority    0
home         0
time         0
age          0
marital      0
records      0
job          0
expenses     0
income       0
assets       0
debt         0
amount       0
price        0
dtype: int64

# Vectorisation

In [25]:
from sklearn.feature_extraction import DictVectorizer

dv = DictVectorizer(sparse=False)
train_dicts = df_train[categorical + numerical].to_dict(orient='records')
X_train = dv.fit_transform(train_dicts)

# Training

In [36]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import roc_auc_score

model = DecisionTreeClassifier(max_depth=3)
model.fit(X_train, y_train)
y_train_pred = model.predict_proba(X_train)[:, 1]
roc= roc_auc_score(y_train, y_train_pred)
print("Training roc_auc:", roc)

Training roc_auc: 0.7837255349531004

In [37]:
val_dicts = df_val[categorical + numerical].to_dict(orient='records')
X_val = dv.transform(val_dicts)
y_val_pred = model.predict_proba(X_val)[:, 1]
roc= roc_auc_score(y_val, y_val_pred)
print("Validation roc_auc:", roc)

Validation roc_auc: 0.7676155332981902

Explore the tree root deeph

In [38]:
from sklearn.tree import export_text
r = export_text(model, feature_names=dv.get_feature_names_out().tolist())
print(r)

|--- seniority <= 3.50
|   |--- records=yes <= 0.50
|   |   |--- job=fixed <= 0.50
|   |   |   |--- class: 1
|   |   |--- job=fixed >  0.50
|   |   |   |--- class: 0
|   |--- records=yes >  0.50
|   |   |--- assets <= 8500.00
|   |   |   |--- class: 1
|   |   |--- assets >  8500.00
|   |   |   |--- class: 1
|--- seniority >  3.50
|   |--- income <= 89.50
|   |   |--- assets <= 3800.00
|   |   |   |--- class: 1
|   |   |--- assets >  3800.00
|   |   |   |--- class: 0
|   |--- income >  89.50
|   |   |--- records=yes <= 0.50
|   |   |   |--- class: 0
|   |   |--- records=yes >  0.50
|   |   |   |--- class: 1